src/ПодсистемаPAPI/InformationRegisters/PAPI_ОшибкиОбработкиПослеЗаписиВерсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>PAPI_ОшибкиОбработкиПослеЗаписиВерсий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидИзменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальнаяВерсия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследняяВерсия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ПодсистемаPAPI/InformationRegisters/PAPI_ОшибкиОбработкиПослеЗаписиВерсий/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.ТипОбъекта)
		И ЗначениеЗаполнено(ТекущиеДанные.ИдОбъекта) Тогда 
		
		СтруктураРегистра = ПолучитьСтруктуруПоУмолчанию();
		ЗаполнитьЗначенияСвойств(СтруктураРегистра, ТекущиеДанные);
		
		ТипОбъекта = "";
	    ИдОбъекта  = "";
		ПолучитьСтруктуруТипУИ(СтруктураРегистра, ТипОбъекта, ИдОбъекта);
		
		ТекущаяНавигационнаяСсылка = PAPI_ОбщегоНазначенияВызовСервера.НайтиОбъектИПолучитьНавигационнуюСсылку(ТипОбъекта, ИдОбъекта);
		Если СтрНайти(ТекущаяНавигационнаяСсылка, "e1cib/data") > 0 Тогда

			ПерейтиПоНавигационнойСсылке(ТекущаяНавигационнаяСсылка);
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПоУмолчанию()
	
	Возврат РегистрыСведений.PAPI_ОшибкиОбработкиПослеЗаписиВерсий.ПолучитьСтруктуруПоУмолчанию();	
	
КонецФункции

&НаСервере
Процедура ПолучитьСтруктуруТипУИ(СтруктураЗаписи, ТипОбъекта, ИдОбъекта)

	СтруктураДанных = PAPI_ОбщегоНазначенияВызовСервера.СтруктураНавигационнойСсылки(СтруктураЗаписи.ИдОбъекта, "Ссылка");	
		
	Если СтруктураДанных.Отработал 
		И СтруктураДанных.Свойство("Результат") Тогда 
		
		ТипОбъекта = СтруктураДанных.Результат.ТипОбъекта;
	    ИдОбъекта  = СтруктураДанных.Результат.ИдОбъекта;   
		
	Иначе
		
		ТипОбъекта = СтруктураЗаписи.ТипОбъекта;
	    ИдОбъекта  = СтруктураЗаписи.ИдОбъекта; 
		
	КонецЕсли;
	
КонецПроцедуры
